Revit 2027 API
WorksetConfigurationOption Enumeration
 A collection of options used to initialize a WorksetConfiguration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WorksetConfigurationOption
Public Enumeration WorksetConfigurationOption
public enum class WorksetConfigurationOption
type WorksetConfigurationOption
Members
Member name | Value | Description
CloseAllWorksets | 1 |  Close all user-created worksets by default. Additional close requests will be ignored for this type of configuration.
OpenAllWorksets | 0 |  Open all user-created worksets by default. Additional open requests will be ignored for this type of configuration.
OpenLastViewed | 2 |  Close all user-created worksets by default, but open last viewed worksets.
See Also
Reference
Autodesk.Revit.DB Namespace